---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomName
source: html/a846864b-a5ba-1bbe-446d-dc2dfb315faf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomName { get; }
```